luqmana/illumos-gate/usr/src/man/man9f/bitins64.9f
.\"
.\" This file and its contents are supplied under the terms of the
.\" Common Development and Distribution License ("CDDL"), version 1.0.
.\" You may only use this file in accordance with the terms of version
.\" 1.0 of the CDDL.
.\"
.\" A full copy of the text of the CDDL should have accompanied this
.\" source.  A copy of the CDDL is also available via the Internet at
.\" http://www.illumos.org/license/CDDL.
.\"
.\"
.\" Copyright 2026 Oxide Computer Company
.\"
.Dd September 18, 2026
.Dt BITINS64 9F
.Os
.Sh NAME
.Nm bitins64
.Nd insert bits into an integer
.Sh SYNOPSIS
.In sys/bitext.h
.Ft uint64_t
.Fo bitins64
.Fa "uint64_t value"
.Fa "uint_t high"
.Fa "uint_t low"
.Fa "uint64_t insert"
.Fc
.Sh INTERFACE LEVEL
.Sy Volatile -
This interface is still evolving in illumos.
API and ABI stability is not guaranteed.
.Sh PARAMETERS
.Bl -tag -width Fa
.It Fa value
An integer to insert bits into.
.It Fa high
The high end, inclusive, of the bit range to insert into
.Fa value .
.It Fa low
The low end, inclusive, of the bit range to insert into
.Fa value .
.It Fa insert
The value to place in the newly inserted bit range.
Only as many low bits of
.Fa insert
as fit in the range are used.
.El
.Sh DESCRIPTION
The
.Fn bitins64
function inserts a range of bits into an integer,
.Fa value .
It is the inverse of
.Xr bitdel64 9F .
All bits of
.Fa value
at or above
.Fa low
are shifted up by the width of the range specified by
.Fa low
and
.Fa high ,
and the range itself is filled with the low bits of
.Fa insert .
Any bits shifted beyond bit 63 are discarded.
.Pp
For example, consider the binary value 0b11_0011
.Pq 0x33 .
If we inserted bits 4 through 7 with an
.Fa insert
value of 0b1010
.Pq 0xa ,
the resulting value would be 0b11_1010_0011
.Pq 0x3a3 .
.Pp
.Fa high
and
.Fa low
are an inclusive range
.Po
.Pf [ Fa low ,
.Fa high ]
.Pc
and the value of
.Fa low
cannot be greater than
.Fa high
or 63.
.Sh RETURN VALUES
Upon successful completion, the
.Fn bitins64
returns the modified integer with the appropriate bits inserted.
.Sh SEE ALSO
.Xr bitdel64 9F ,
.Xr bitset64 9F ,
.Xr bitx64 9F
